packages/inductiva/inductiva-0.3.0-py3-none-any.whl/inductiva/templates/wind_terrain/openfoam/files/system/topoSetDict_template.openfoam.jinja
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // actuationDisk1
    {
        name    actuationDisk1CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box ({{ flow_position[0] - 10}} {{ flow_position[1] - 10 }} {{ flow_position[2] -10 }}) ({{ flow_position[0] + 10}} {{ flow_position[1] + 10 }} {{ flow_position[2] + 10 }});
        }
    }
    {
        name    actuationDisk1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set actuationDisk1CellSet;
        }
    }
);

// ************************************************************************* //
